{
  "01-01": "On this day in 1801, Giuseppe Piazzi discovered Ceres, now classified as a dwarf planet and the largest object in the asteroid belt. 🔭 #Ceres #OnThisDay #Astronomy",
  "01-02": "In 1959, the Soviet Union launched Luna 1. Intended to impact the Moon, it missed and became the first spacecraft to reach the vicinity of the Moon and the first to orbit the Sun. 🚀 #Luna1 #SpaceRace",
  "01-03": "The Quadrantid meteor shower, one of the most active of the year, peaks tonight! Look for bright fireballs from a dark sky location. 🌠 #Quadrantids #MeteorShower",
  "01-04": "In 2004, NASA's Spirit rover successfully landed on Mars. It would go on to explore the red planet for over six years, far exceeding its planned 90-day mission. 🔴 #SpiritRover #Mars",
  "01-05": "On this day in 1972, President Nixon announced the development of the Space Shuttle program, paving the way for a new era of reusable spacecraft. #SpaceShuttle #NASA",
  "01-06": "Happy birthday to John Young, the only astronaut to fly on Gemini, Apollo, and Space Shuttle missions, and one of only 12 people to walk on the Moon. 🎂 #JohnYoung #Astronaut",
  "01-07": "In 1610, Galileo Galilei first observed the four largest moons of Jupiter—Io, Europa, Ganymede, and Callisto—now known as the Galilean moons. 🪐 #Galileo #Jupiter",
  "01-08": "Happy birthday to renowned physicist Stephen Hawking (born 1942), whose work on black holes and cosmology fundamentally changed our understanding of the universe. #StephenHawking",
  "01-09": "In 2022, the James Webb Space Telescope successfully completed the deployment of its massive 21-foot, gold-coated primary mirror. ✨ #JWST #Engineering",
  "01-10": "On this day in 1946, the U.S. Army's Project Diana successfully bounced radar signals off the Moon, marking the birth of radar astronomy. 📡 #Radar #Moon",
  "01-11": "In 1787, William Herschel discovered Titania and Oberon, the two largest moons of Uranus. #Uranus #Moons",
  "01-12": "In 2005, NASA's Deep Impact spacecraft launched on its mission to slam an impactor into Comet Tempel 1 to study its interior composition. ☄️ #DeepImpact #Comet",
  "01-13": "On this day in 1993, the Space Shuttle Endeavour launched on mission STS-54, deploying the TDRS-6 communications satellite. #SpaceShuttle #OnThisDay",
  "01-14": "In 2005, the Huygens probe successfully landed on Saturn's moon Titan, revealing a world with liquid methane rivers and lakes. An incredible achievement! #Huygens #Titan",
  "01-15": "NASA's Stardust mission returned to Earth on this day in 2006, carrying the first-ever dust samples collected from a comet (Wild 2). 🌠 #Stardust #Comet",
  "01-16": "In 1969, Soviet spacecraft Soyuz 4 and Soyuz 5 performed the first-ever docking of two crewed spacecraft in orbit and transferred crew between them. #Soyuz #SpaceHistory",
  "01-17": "Happy birthday to astronaut Shannon Lucid, a veteran of five spaceflights and former holder of the record for the longest duration in space by an American. 🎂 #WomenInSTEM",
  "01-18": "In 1910, the Great January Comet of 1910 first became visible, becoming one of the brightest comets of the 20th century. #Comet #History",
  "01-19": "NASA's New Horizons spacecraft launched on this day in 2006. It would perform the first-ever flyby of Pluto nine years later. #NewHorizons #Pluto",
  "01-20": "Happy birthday to Buzz Aldrin (born 1930), Apollo 11 lunar module pilot and the second person to walk on the Moon. 🌕 #BuzzAldrin #Apollo11",
  "01-21": "In 1960, a rhesus monkey named Miss Sam was launched in a Little Joe capsule to test the launch escape system for the Mercury program. 🐒 #SpaceMonkey #MercuryProgram",
  "01-22": "Today in 2003, NASA received the last signal from the Pioneer 10 spacecraft, which was over 7.5 billion miles from Earth. An incredible journey. #Pioneer10",
  "01-23": "Today in 2014, the European Space Agency's Rosetta spacecraft was successfully woken from a 31-month hibernation period on its way to Comet 67P. 😴 #Rosetta",
  "01-24": "In 1986, the Voyager 2 spacecraft made its closest approach to Uranus, providing the first detailed images of the ice giant and its moons. #Voyager2 #Uranus",
  "01-25": "On this day in 2004, the Opportunity rover landed on Mars, just three weeks after its twin, Spirit. It would operate for over 14 years. #Oppy #Mars",
  "01-26": "The Infrared Astronomical Satellite (IRAS) was launched on this day in 1983. It mapped 96% of the sky in infrared, discovering new comets, asteroids, and a dust disk around the star Vega. 🔭 #IRAS",
  "01-27": "In 1967, the crew of Apollo 1—Gus Grissom, Ed White, and Roger Chaffee—tragically lost their lives in a cabin fire during a launch rehearsal. We honor their sacrifice. #Apollo1",
  "01-28": "On this day in 1986, the Space Shuttle Challenger and its seven-person crew were lost 73 seconds after liftoff. We remember them today. #Challenger",
  "01-29": "Happy birthday to Katherine Johnson (born 1918), the brilliant NASA mathematician whose calculations were critical to the success of the first U.S. crewed spaceflights. HiddenFigures",
  "01-30": "On this day in 1964, the Ranger 6 spacecraft was launched on a mission to transmit pictures of the Moon's surface before impact. (Its cameras unfortunately failed to activate). #Ranger6",
  "01-31": "In 1958, the United States launched its first satellite, Explorer 1, which led to the discovery of the Van Allen radiation belts. 🛰️ #Explorer1 #SpaceRace",
  "02-01": "On this day in 2003, the Space Shuttle Columbia was lost during re-entry, along with its seven-person crew. Today, we honor the memory of the STS-107 crew. #Columbia",
  "02-02": "In 1965, Mariner 4 conducted the first successful flyby of Mars, returning the first close-up images of another planet's surface. #Mariner4 #Mars",
  "02-03": "In 1966, the Soviet Luna 9 probe achieved the first-ever soft landing on the Moon, transmitting the first images from the lunar surface. A monumental achievement. 🌕 #Luna9",
  "02-04": "On this day in 1974, Mariner 10 became the first spacecraft to use a gravity assist, slingshotting around Venus to reach Mercury. A key moment in astrodynamics. #Mariner10",
  "02-05": "Happy birthday to astronaut Alan Shepard, the first American in space and one of only 12 people to walk on the Moon. 🚀 #AlanShepard",
  "02-06": "On this day in 1971, Apollo 14 astronaut Alan Shepard famously hit two golf balls on the Moon. 🏌️‍♂️ #Apollo14 #Moon",
  "02-07": "In 1984, astronaut Bruce McCandless II performed the first untethered spacewalk, using the Manned Maneuvering Unit (MMU). An iconic image of human spaceflight. #Spacewalk",
  "02-08": "Happy birthday to Jules Verne (born 1828), the visionary author of \"From the Earth to the Moon\" and \"Twenty Thousand Leagues Under the Seas.\" 📚 #JulesVerne",
  "02-09": "In 1986, Halley's Comet reached its perihelion (closest approach to the Sun) during its most recent pass through the inner solar system. It will return in 2061. ☄️ #HalleysComet",
  "02-10": "Today in 2009, two communications satellites—Iridium 33 and Kosmos-2251—collided in orbit, highlighting the growing risk of space debris. 🛰️ #SpaceDebris",
  "02-11": "In 1970, Japan launched its first satellite, Osumi, becoming the fourth nation to achieve independent satellite launch capability. #JAXA #Osumi",
  "02-12": "On this day in 2001, the NEAR Shoemaker probe successfully landed on the asteroid 433 Eros, becoming the first spacecraft to land on an asteroid. #NEAR #Asteroid",
  "02-13": "Happy birthday to Charles \"Chuck\" Yeager (born 1923), the legendary test pilot who was the first person to officially break the sound barrier. #ChuckYeager",
  "02-14": "In 1990, Voyager 1 turned its camera back to take the \"Pale Blue Dot\" photo, a portrait of our solar system showing Earth as a tiny speck from 6 billion km away. 🌍 #PaleBlueDot #CarlSagan",
  "02-15": "Happy birthday to Galileo Galilei (born 1564), the father of observational astronomy, whose discoveries with the telescope revolutionized our view of the cosmos. 🔭 #Galileo",
  "02-16": "In 1948, Gerard Kuiper discovered Miranda, the smallest and innermost of Uranus's five major moons. #Uranus #Miranda",
  "02-17": "On this day in 1959, Vanguard 2 was launched, becoming the first satellite designed to monitor weather. It paved the way for modern meteorology. ☁️ #WeatherSatellite",
  "02-18": "In 1930, American astronomer Clyde Tombaugh discovered Pluto at the Lowell Observatory in Flagstaff, Arizona. 🪐 #Pluto #Discovery",
  "02-19": "Happy birthday to Nicolaus Copernicus (born 1473), the astronomer who proposed a heliocentric model of the universe, placing the Sun at the center. #Copernicus",
  "02-20": "On this day in 1962, John Glenn became the first American to orbit the Earth aboard the Friendship 7 Mercury capsule. 🚀 #JohnGlenn #NASA",
  "02-21": "In 1947, the first test flight of the liquid-fueled Bumper rocket, a two-stage rocket combining a V-2 and a WAC Corporal, took place at White Sands. #Rocketry",
  "02-22": "On this day in 2017, NASA announced the discovery of the TRAPPIST-1 system, with seven Earth-sized planets orbiting a single star, some in the habitable zone. #TRAPPIST1 #Exoplanets",
  "02-23": "In 1987, Supernova 1987A was observed in the Large Magellanic Cloud. It was the closest and brightest supernova seen in over 400 years. ✨ #Supernova",
  "02-24": "Today in 1968, the discovery of the first pulsar was announced by astronomers Jocelyn Bell Burnell and Antony Hewish, revealing the existence of rapidly rotating neutron stars. #Pulsar",
  "02-25": "In 1969, Mariner 6 launched on a mission to fly by Mars, studying its atmosphere and surface. #Mariner6 #Mars",
  "02-26": "On this day in 1966, the first Saturn IB rocket was launched for an uncrewed suborbital test flight as part of the Apollo program. #SaturnIB #Apollo",
  "02-27": "Happy birthday to James Van Allen (born 1914), the space scientist who discovered the magnetospheric radiation belts that bear his name, confirmed by Explorer 1. #VanAllenBelts",
  "02-28": "On this day in 2007, the New Horizons spacecraft performed a gravity assist flyby of Jupiter, testing its instruments and capturing incredible images of the giant planet on its way to Pluto. #NewHorizons #Jupiter",
  "03-01": "In 1966, the Soviet Venera 3 probe crashed on Venus, becoming the first spacecraft to impact the surface of another planet. #Venera3 #SpaceHistory",
  "03-02": "On this day in 1972, NASA launched Pioneer 10. It was the first spacecraft to travel through the asteroid belt and the first to make direct observations of Jupiter. 🚀 #Pioneer10",
  "03-03": "In 1969, Apollo 9 launched on a critical Earth-orbiting mission to test the Lunar Module, the spacecraft that would later land astronauts on the Moon. #Apollo9 #NASA",
  "03-04": "On this day in 1979, the Voyager 1 spacecraft discovered the faint, dusty rings of Jupiter, a surprise to scientists at the time. #Voyager1 #Jupiter",
  "03-05": "In 1979, a powerful gamma-ray burst was detected. The event was traced to a magnetar in the Large Magellanic Cloud, helping to confirm theories about neutron stars. #Astronomy",
  "03-06": "Happy birthday to Valentina Tereshkova (born 1937), the first woman to travel to space, aboard the Vostok 6 mission in 1963. 👩‍🚀 #WomenInSTEM",
  "03-07": "In 2009, NASA's Kepler Space Telescope launched on its mission to discover Earth-sized planets orbiting other stars. Its discoveries revolutionized exoplanet science. 🔭 #Kepler",
  "03-08": "Happy birthday to astronaut Michael S. Hopkins (born 1968), who commanded the first operational flight of the SpaceX Crew Dragon, Crew-1. #Astronaut",
  "03-09": "Happy birthday to Yuri Gagarin (born 1934), the Soviet cosmonaut who became the first human to journey into outer space on April 12, 1961. #YuriGagarin",
  "03-10": "Today in 1977, the rings of Uranus were discovered by astronomers aboard the Kuiper Airborne Observatory. They spotted them when the planet passed in front of a star. #Uranus",
  "03-11": "In 2011, the Space Shuttle Discovery completed its 39th and final mission, STS-133, landing at Kennedy Space Center. #SpaceShuttle #Discovery",
  "03-12": "Happy birthday to astronaut Mae C. Jemison (born 1956), who became the first African American woman to travel to space aboard the Space Shuttle Endeavour in 1992. #MaeJemison",
  "03-13": "On this day in 1781, William Herschel discovered the planet Uranus, the first planet to be found with the aid of a telescope. #Uranus #Astronomy",
  "03-14": "Happy birthday to Albert Einstein (born 1879). His theory of General Relativity forms the foundation of modern cosmology. Also, happy Pi Day! 🥧 #Einstein #PiDay",
  "03-15": "Today in 2005, the first test firing of the RS-68 engine for the new Ares I rocket was completed as part of the Constellation program. #RocketEngine",
  "03-16": "In 1926, Robert Goddard launched the world's first liquid-fueled rocket in Auburn, Massachusetts, an event that heralded the dawn of the space age. 🚀 #Rocketry",
  "03-17": "On this day in 1958, the United States launched Vanguard 1, the fourth artificial satellite and the oldest one still orbiting Earth today. 🛰️ #Vanguard1",
  "03-18": "In 1965, Soviet cosmonaut Alexei Leonov performed the first-ever spacewalk, exiting the Voskhod 2 capsule for 12 minutes. A historic moment. #Spacewalk",
  "03-19": "On this day in 2011, the MESSENGER spacecraft successfully entered orbit around Mercury, becoming the first probe to do so. #MESSENGER #Mercury",
  "03-20": "Today is the March Equinox! Day and night are of nearly equal length across the globe as the Sun shines directly on the equator, marking the start of spring in the Northern Hemisphere. 춘 #Equinox",
  "03-21": "In 2001, the Russian space station Mir was deorbited after 15 years of service, burning up in a controlled re-entry over the Pacific Ocean. #Mir #SpaceStation",
  "03-22": "Today in 1995, cosmonaut Valeri Polyakov returned to Earth after a record 437 days in space aboard the Mir space station, the longest single human spaceflight in history. #Record",
  "03-23": "On this day in 1840, John William Draper took the first successful photograph of an astronomical object: the Moon. 🌔 #Astrophotography",
  "03-24": "In 1993, astronomers Carolyn and Eugene Shoemaker and David Levy discovered Comet Shoemaker-Levy 9. A year later, it famously collided with Jupiter. ☄️ #Comet",
  "03-25": "On this day in 1655, Christiaan Huygens discovered Titan, Saturn's largest moon and the only moon in our solar system with a dense atmosphere. #Titan #Saturn",
  "03-26": "Today in 2015, NASA's Magnetospheric Multiscale Mission (MMS) was launched to study the mystery of magnetic reconnection. #NASA #MMS",
  "03-27": "In 1972, the Soviet Union launched Venera 8. It became the second probe to successfully land on Venus and the first to transmit data from the surface. #Venera8 #Venus",
  "03-28": "Happy birthday to astronomer William Herschel (born 1738), who discovered Uranus, several moons, and infrared radiation. #WilliamHerschel",
  "03-29": "On this day in 1974, Mariner 10 became the first spacecraft to fly by Mercury, revealing a cratered, moon-like surface. #Mariner10 #Mercury",
  "03-30": "In 2017, SpaceX achieved a major milestone by successfully launching a previously flown Falcon 9 first-stage booster, proving the viability of reusable rockets. 🚀 #SpaceX",
  "03-31": "On this day in 1966, the Soviet Luna 10 probe was launched. It would become the first artificial satellite to orbit the Moon. #Luna10 #Moon",
  "04-01": "In 1960, the United States launched TIROS-1, the first successful weather satellite, giving us our first-ever televised pictures of Earth's weather from space. 🛰️ #TIROS1 #Earth",
  "04-02": "On this day in 1957, the National Advisory Committee for Aeronautics (NACA) was officially renamed the National Aeronautics and Space Administration (NASA). #NASA",
  "04-03": "In 1966, the Soviet Luna 10 probe became the first spacecraft to enter orbit around the Moon. #Luna10 #SpaceRace",
  "04-04": "On this day in 1968, NASA launched Apollo 6, the second and final uncrewed test flight of the mighty Saturn V rocket. 🚀 #Apollo6 #SaturnV",
  "04-05": "Happy birthday to astronaut Judith Resnik (born 1949), an electrical engineer and mission specialist who tragically died aboard the Space Shuttle Challenger. #WomenInSTEM",
  "04-06": "In 1965, Intelsat I, also known as \"Early Bird,\" was launched, becoming the first commercial communications satellite in geosynchronous orbit. 📡 #Satellite",
  "04-07": "On this day in 2001, the 2001 Mars Odyssey spacecraft was launched. It is currently the longest-surviving spacecraft in orbit around a planet other than Earth. 🔴 #MarsOdyssey",
  "04-08": "In 1964, Gemini 1 was launched. It was the first uncrewed test flight of the Gemini program, which paved the way for the Apollo missions. #Gemini1 #NASA",
  "04-09": "On this day in 1959, NASA introduced the \"Mercury Seven,\" the first group of American astronauts selected for the Mercury program. #MercurySeven #Astronauts",
  "04-10": "In 2019, the Event Horizon Telescope team revealed the first-ever image of a black hole, a monumental achievement in astrophysics. ⚫ #BlackHole #EHT",
  "04-11": "On this day in 1970, Apollo 13 launched on its fateful mission to the Moon. The \"successful failure\" would become a testament to human ingenuity. #Apollo13",
  "04-12": "The International Day of Human Space Flight! In 1961, Yuri Gagarin became the first human in space. 20 years later, in 1981, the first Space Shuttle, Columbia, launched. 🧑‍🚀 #YuriGagarin #SpaceShuttle",
  "04-13": "\"Houston, we've had a problem.\" On this day in 1970, an oxygen tank exploded aboard Apollo 13, forcing the crew to abort their Moon landing. #Apollo13",
  "04-14": "Happy birthday to Christiaan Huygens (born 1629), the Dutch astronomer who discovered Saturn's rings and its largest moon, Titan. 🪐 #Huygens",
  "04-15": "Happy birthday to Leonardo da Vinci (born 1452). His early concepts of flight and flying machines were centuries ahead of their time. ✈️ #DaVinci",
  "04-16": "In 1972, Apollo 16 launched on the fifth mission to land humans on the Moon, carrying the Lunar Roving Vehicle. 🌕 #Apollo16 #Moon",
  "04-17": "On this day in 1970, the crew of Apollo 13 safely returned to Earth, splashing down in the Pacific Ocean after a harrowing journey. An incredible survival story. #Apollo13",
  "04-18": "In 2018, NASA's Transiting Exoplanet Survey Satellite (TESS) was launched on a mission to search for exoplanets orbiting nearby bright stars. #TESS #Exoplanets",
  "04-19": "On this day in 1971, the Soviet Union launched Salyut 1, the world's first space station, into low Earth orbit. #Salyut1 #SpaceStation",
  "04-20": "Happy birthday to astronaut Charles Duke (born 1935), who served as the Lunar Module Pilot for Apollo 16 and was the tenth person to walk on the Moon. #Apollo16",
  "04-21": "In 1997, the first space burial took place when a Pegasus rocket carried a portion of the cremated remains of 24 people, including Star Trek creator Gene Roddenberry, into Earth orbit. #Space",
  "04-22": "The Lyrid meteor shower peaks tonight! It's one of the oldest known meteor showers, with records of its observation dating back over 2,700 years. Happy Earth Day! 🌍 #Lyrids #EarthDay",
  "04-23": "Today in 1962, Ranger 4 was launched. After its systems failed, it became the first U.S. spacecraft to impact the far side of the Moon. #Ranger4",
  "04-24": "In 1990, the Hubble Space Telescope was deployed from the Space Shuttle Discovery. It has since revolutionized nearly every area of astronomy. 🔭 #Hubble",
  "04-25": "On this day in 2003, the crew of ISS Expedition 6 undocked from the International Space Station aboard a Soyuz capsule, leaving the station temporarily empty for the first time. #ISS",
  "04-26": "Today in 2017, the Cassini spacecraft performed its first \"Grand Finale\" dive between Saturn and its rings, beginning the final, daring phase of its mission. #Cassini #Saturn",
  "04-27": "Happy birthday to astronaut and engineer Joe Engle (born 1932), who commanded two Space Shuttle missions, including the second flight of Columbia. #Astronaut",
  "04-28": "In 2001, American businessman Dennis Tito launched aboard a Soyuz rocket to the ISS, becoming the world's first self-funded space tourist. 💰 #SpaceTourism",
  "04-29": "Happy birthday to astronomer Karl Jansky (born 1905), whose discovery of radio waves emanating from the Milky Way led to the birth of radio astronomy. 🌌 #RadioAstronomy",
  "04-30": "On this day in 1993, the World Wide Web protocol was released into the public domain by CERN, a critical step in the internet's growth. The web is essential for sharing today's space discoveries! #WWW",
  "05-01": "Happy birthday to Gerard Kuiper (born 1905), the Dutch-American astronomer for whom the Kuiper Belt is named. #KuiperBelt #Astronomy",
  "05-02": "In 1963, the first satellite of the Global Navigation Satellite System (GNSS), GLONASS, was launched. #GLONASS #Satellite",
  "05-03": "Happy birthday to astronaut and physicist Steven Weinberg (born 1933), who won the Nobel Prize for his work on the electroweak force. #Physics",
  "05-04": "May the 4th be with you! On this day in 1989, the Magellan spacecraft was deployed from the Space Shuttle Atlantis, setting course to map the surface of Venus with radar. #MayThe4th #Venus",
  "05-05": "In 1961, Alan Shepard became the first American in space, launching on a 15-minute suborbital flight aboard the Freedom 7 Mercury capsule. 🚀 #AlanShepard #NASA",
  "05-06": "The Eta Aquariid meteor shower, debris from Halley's Comet, peaks this week. Look for swift meteors emanating from the constellation Aquarius before dawn. 🌠 #EtaAquariids",
  "05-07": "On this day in 1992, the Space Shuttle Endeavour launched on its maiden flight, STS-49, a mission to rescue and repair a stranded communications satellite. #SpaceShuttle",
  "05-08": "In 1846, Robert Thompson patented the pneumatic tire. High-performance tires, like those on the Space Shuttle, are a direct descendant of this invention. #Invention",
  "05-09": "In 1975, the Soyuz 18 mission launched, carrying two cosmonauts to the Salyut 4 space station for a 63-day stay. #Soyuz #Salyut4",
  "05-10": "On this day in 1946, a V-2 rocket launched from White Sands Missile Range carried the first American experiment to study cosmic radiation in the upper atmosphere. #V2Rocket",
  "05-11": "Today in 2009, the Space Shuttle Atlantis launched on STS-125, the fifth and final servicing mission to the Hubble Space Telescope, greatly extending its life. 🔭 #Hubble",
  "05-12": "Happy birthday to Frank Drake (born 1930), the astronomer who created the Drake Equation to estimate the number of active, communicative extraterrestrial civilizations. #SETI",
  "05-13": "Happy birthday to astronomer and comet hunter Carolyn S. Shoemaker (born 1929), co-discoverer of Comet Shoemaker–Levy 9. ☄️ #WomenInSTEM",
  "05-14": "In 1973, the United States launched Skylab, its first space station, aboard the final flight of a Saturn V rocket. #Skylab #SpaceStation",
  "05-15": "On this day in 1618, Johannes Kepler published his third law of planetary motion, which describes the relationship between a planet's orbital period and its distance from the Sun. #Kepler",
  "05-16": "Today in 1969, the Soviet Venera 5 probe entered the atmosphere of Venus, returning 53 minutes of atmospheric data before being destroyed by the harsh conditions. #Venera5",
  "05-17": "On this day in 1969, the Venera 6 probe entered the atmosphere of Venus, just one day after its twin, Venera 5. #Venera6 #Venus",
  "05-18": "In 1991, Helen Sharman became the first Briton in space, launching on a Soyuz mission to the Mir space station. #HelenSharman",
  "05-19": "On this day in 1961, the Soviet Venera 1 probe flew by Venus, becoming the first spacecraft to fly past another planet. (Contact had been lost prior to the flyby). #Venera1",
  "05-20": "In 1978, NASA launched the Pioneer Venus Orbiter, the first of two spacecraft in the Pioneer Venus Project, which studied Venus for over 14 years. #PioneerVenus",
  "05-21": "Today in 2010, the Japanese space probe Akatsuki was launched on a mission to study the atmosphere of Venus. It successfully entered orbit in 2015. #JAXA #Akatsuki",
  "05-22": "On this day in 1969, the Apollo 10 crew performed a \"dress rehearsal\" for the first Moon landing, flying the Lunar Module \"Snoopy\" to within 9 miles of the lunar surface. #Apollo10",
  "05-23": "Happy birthday to Sally Ride (born 1951), the brilliant astronaut and physicist who became the first American woman to fly in space in 1983. 👩‍🚀 #SallyRide",
  "05-24": "In 1962, Scott Carpenter became the second American to orbit the Earth, flying the Aurora 7 Mercury capsule. #ScottCarpenter #MercuryProgram",
  "05-25": "On this day in 2008, NASA's Phoenix lander touched down in the northern polar region of Mars to search for water ice. 🧊 #PhoenixLander #Mars",
  "05-26": "In 1969, the crew of Apollo 10 returned safely to Earth after their successful lunar orbit and LM test mission. #Apollo10",
  "05-27": "Happy birthday to astronaut Alan Bean (born 1932), the fourth person to walk on the Moon as the Lunar Module Pilot of Apollo 12. 🌕 #AlanBean",
  "05-28": "On this day in 1959, two monkeys, Able and Baker, became the first animals to be successfully recovered after a flight into space. 🐒 #SpaceMonkeys",
  "05-29": "In 1919, a total solar eclipse allowed expeditions led by Arthur Eddington to photograph starlight bending around the Sun, providing the first experimental proof of Einstein's theory of General Relativity. #Einstein",
  "05-30": "On this day in 2020, SpaceX launched the Demo-2 mission, the first crewed flight of the Crew Dragon spacecraft and the first crewed orbital launch from the U.S. since 2011. A new era begins! 🚀 #SpaceX #CrewDragon",
  "05-31": "In 1975, the European Space Agency (ESA) was founded, bringing together the space exploration efforts of multiple European nations. #ESA",
  "06-01": "In 1937, the first photograph of the Sun's corona without an eclipse was taken by astronomer Bernard Lyot using his newly invented coronagraph. ☀️ #Sun #Coronagraph",
  "06-02": "On this day in 1966, Surveyor 1 became the first American spacecraft to achieve a soft landing on the Moon, returning thousands of images. 🌕 #Surveyor1 #Moon",
  "06-03": "In 1965, astronaut Ed White performed the first American spacewalk during the Gemini 4 mission, spending 23 minutes outside the capsule. 🧑‍🚀 #EdWhite #Spacewalk",
  "06-04": "On this day in 1996, the powerful Ariane 5 rocket launched on its maiden flight. Unfortunately, it failed and was destroyed 37 seconds after liftoff. #Ariane5",
  "06-05": "Happy birthday to Nancy Grace Roman (born 1925), the \"Mother of Hubble,\" whose tireless advocacy and planning made the Hubble Space Telescope a reality. 🔭 #WomenInSTEM",
  "06-06": "In 1971, the Soyuz 11 mission launched, carrying three cosmonauts for a 22-day stay aboard the Salyut 1 space station, the first crew to inhabit a space station. #Soyuz11",
  "06-07": "On this day in 2003, NASA launched the Mars Exploration Rover Spirit on its journey to the Red Planet. #SpiritRover #Mars",
  "06-08": "In 2007, the Space Shuttle Atlantis launched on mission STS-117 to deliver a new set of solar arrays to the International Space Station. #SpaceShuttle",
  "06-09": "Happy birthday to astronaut and engineer Michael J. Massimino (born 1962), a veteran of two Space Shuttle missions to service the Hubble Space Telescope. 🎂 #Astronaut",
  "06-10": "On this day in 2003, just days after its twin, the Mars Exploration Rover Opportunity was launched from Cape Canaveral. 🔴 #Oppy #Mars",
  "06-11": "In 2008, NASA's Fermi Gamma-ray Space Telescope was launched on a mission to study the most extreme environments in the universe. 🌌 #Fermi #GammaRays",
  "06-12": "On this day in 1967, the Soviet Union launched the Venera 4 probe. It would become the first spacecraft to transmit data from deep within another planet's atmosphere (Venus). #Venera4",
  "06-13": "In 1983, the Pioneer 10 spacecraft crossed the orbit of Neptune, becoming the first human-made object to venture beyond the major planets of our solar system. #Pioneer10",
  "06-14": "On this day in 1967, the United States launched Mariner 5 on a flyby mission to Venus. #Mariner5 #Venus",
  "06-15": "Today in 2011, a total lunar eclipse was visible over Europe, Africa, Asia, and Australia, one of the longest and darkest of the 21st century. 🌒 #LunarEclipse",
  "06-16": "In 1963, Valentina Tereshkova became the first woman in space, launching aboard the Vostok 6 capsule for a three-day mission. #ValentinaTereshkova",
  "06-17": "On this day in 2009, NASA launched the Lunar Reconnaissance Orbiter (LRO) and the LCROSS probe, beginning a new era of lunar exploration. #LRO #Moon",
  "06-18": "In 1983, Sally Ride became the first American woman in space, launching with the crew of Space Shuttle Challenger mission STS-7. 🚀 #SallyRide",
  "06-19": "On this day in 2012, the Soyuz TMA-03M spacecraft landed in Kazakhstan, returning astronauts Don Pettit, Oleg Kononenko, and André Kuipers from the ISS. #Soyuz #ISS",
  "06-20": "Today is the June Solstice, the longest day of the year in the Northern Hemisphere and the official start of summer. ☀️ #Solstice #Summer",
  "06-21": "In 2004, SpaceShipOne completed the first privately funded human spaceflight, a major milestone for commercial space travel. #SpaceShipOne",
  "06-22": "On this day in 1978, astronomer James Christy discovered Charon, the largest moon of Pluto. The discovery revealed Pluto to be part of a binary system. #Pluto #Charon",
  "06-23": "Happy birthday to astronaut Donn F. Eisele (born 1930), who served as the Command Module Pilot for Apollo 7, the first crewed flight of the Apollo spacecraft. #Apollo7",
  "06-24": "Today in 1947, pilot Kenneth Arnold reported the first widely publicized sighting of an unidentified flying object, which he described as flying like a \"saucer skipping on water.\" #UFO",
  "06-25": "On this day in 1997, the Progress M-34 cargo ship collided with the Russian space station Mir during a docking test, causing significant damage. #Mir #SpaceStation",
  "06-26": "Happy birthday to Charles Messier (born 1730), the French astronomer who compiled the famous Messier Catalog of nebulae and star clusters. ✨ #Messier",
  "06-27": "In 1997, the NEAR Shoemaker spacecraft performed a flyby of the asteroid 253 Mathilde. #NEAR #Asteroid",
  "06-28": "On this day in 1908, the Tunguska event occurred in Siberia, a massive explosion thought to be caused by an asteroid or comet air burst, flattening 80 million trees. #Tunguska",
  "06-29": "In 1971, the crew of Soyuz 11 performed the first-ever docking with a space station, Salyut 1. #Soyuz11 #Salyut1",
  "06-30": "On this day in 1971, the three cosmonauts of the Soyuz 11 crew tragically died during re-entry due to cabin depressurization. Today is also Asteroid Day. ☄️ #Soyuz11 #AsteroidDay",
  "07-01": "On this day in 1957, the International Geophysical Year (IGY) began. This global scientific effort led to the launch of the world's first satellites, kicking off the Space Race. #IGY #SpaceRace",
  "07-02": "Happy birthday to Harrison Schmitt (born 1935), the only geologist to walk on the Moon, who served as the Lunar Module Pilot for Apollo 17. geologist #Apollo17",
  "07-03": "In 2010, the European Space Agency's Rosetta spacecraft flew by the asteroid 21 Lutetia, providing detailed images of a main-belt asteroid. #Rosetta #Asteroid",
  "07-04": "On this day in 1997, NASA's Mars Pathfinder mission landed on Mars, deploying the Sojourner rover—the first wheeled vehicle to explore another planet. 🔴 #MarsPathfinder #July4th",
  "07-05": "In 1687, Isaac Newton published his Philosophiæ Naturalis Principia Mathematica, which laid the foundations for classical mechanics and the law of universal gravitation. 📚 #Newton",
  "07-06": "In 2003, the Opportunity rover was launched on its journey to Mars. #Oppy #Mars",
  "07-07": "On this day in 1959, the first test of the launch escape system for the Mercury capsule was conducted using a Little Joe rocket. #MercuryProgram",
  "07-08": "The final Space Shuttle mission, STS-135, launched on this day in 2011, with Space Shuttle Atlantis heading to the ISS, closing a 30-year chapter of human spaceflight. #SpaceShuttle",
  "07-09": "In 1979, the Voyager 2 spacecraft made its closest approach to Jupiter, discovering several new moons and observing volcanic activity on Io. 🪐 #Voyager2 #Jupiter",
  "07-10": "On this day in 1962, the Telstar 1 satellite was launched, enabling the first live transatlantic television broadcast. A new era of global communication began. 📡 #Telstar",
  "07-11": "In 1979, America's first space station, Skylab, re-entered Earth's atmosphere over the Indian Ocean and Western Australia. #Skylab",
  "07-12": "Happy birthday to astronaut and physician, Dr. Mae C. Jemison, the first African American woman to travel to space. 🎂 #MaeJemison #WomenInSTEM",
  "07-13": "On this day in 2011, the Hubble Space Telescope completed its one-millionth scientific observation, targeting an exoplanet 1,000 light-years away. 🔭 #Hubble",
  "07-14": "In 2015, NASA's New Horizons spacecraft performed the first-ever flyby of Pluto, revealing a complex and geologically active world. An incredible moment of exploration. #NewHorizons #Pluto",
  "07-15": "On this day in 1975, the Apollo-Soyuz Test Project launched, a historic mission that saw the first joint space flight between the U.S. and the Soviet Union. 🤝 #ApolloSoyuz",
  "07-16": "In 1969, Apollo 11 launched from Kennedy Space Center, carrying astronauts Neil Armstrong, Buzz Aldrin, and Michael Collins on the first mission to land humans on the Moon. 🚀 #Apollo11",
  "07-17": "In 1975, the American Apollo and Soviet Soyuz spacecraft successfully docked in orbit, and their commanders, Thomas Stafford and Alexei Leonov, shook hands in space. #ApolloSoyuz",
  "07-18": "Happy birthday to John Glenn (born 1921), the first American to orbit the Earth and a United States senator. A true hero. #JohnGlenn",
  "07-19": "On this day in 1969, the Apollo 11 spacecraft successfully entered orbit around the Moon. #Apollo11 #Moon",
  "07-20": "\"The Eagle has landed.\" On this day in 1969, the Apollo 11 Lunar Module \"Eagle\" touched down on the Moon's Sea of Tranquility. 🌕 #Apollo11Landing",
  "07-21": "In 1969, Neil Armstrong and Buzz Aldrin became the first humans to walk on the Moon. On this day in 2011, the final Space Shuttle mission, STS-135, landed, concluding the program. #FirstMan #SpaceShuttle",
  "07-22": "On this day in 1972, the Soviet Venera 8 probe successfully landed on Venus, surviving for 50 minutes on the scorching surface. #Venera8 #Venus",
  "07-23": "In 1999, the Chandra X-ray Observatory was deployed from the Space Shuttle Columbia. It has been observing the universe's most energetic phenomena ever since. ✨ #Chandra",
  "07-24": "On this day in 1969, the crew of Apollo 11 safely splashed down in the Pacific Ocean, successfully concluding their historic mission to the Moon. #Apollo11",
  "07-25": "In 1984, Soviet cosmonaut Svetlana Savitskaya became the first woman to perform a spacewalk, working outside the Salyut 7 space station for over three hours. #Spacewalk",
  "07-26": "On this day in 1971, Apollo 15 was launched. It was the first of the extended \"J-missions\" to the Moon, featuring the first use of the Lunar Roving Vehicle. 🚙 #Apollo15",
  "07-27": "The Southern Delta Aquariid meteor shower is active now and set to peak in the next few days! Look for faint meteors from a dark location. 🌠 #DeltaAquariids",
  "07-28": "In 1964, the Ranger 7 spacecraft was launched. It would go on to transmit the first close-up images of the Moon, revealing details never seen before. #Ranger7",
  "07-29": "On this day in 1958, President Eisenhower signed the National Aeronautics and Space Act, officially creating NASA. 🎂 #NASA",
  "07-30": "In 1971, the Apollo 15 astronauts landed on the Moon, beginning the most scientifically ambitious lunar mission yet. #Apollo15 #MoonLanding",
  "07-31": "On this day in 1964, Ranger 7 impacted the Moon, transmitting incredible high-resolution images right up to the final moments. #Ranger7",
  "08-01": "In 1955, the first issue of \"Astronautics\" magazine was published by the American Rocket Society. #Astronautics",
  "08-02": "On this day in 1971, the Apollo 15 crew drove the Lunar Roving Vehicle on the Moon for the third and final time, concluding its first use in exploration. 🚙 #Apollo15 #LRV",
  "08-03": "In 2004, NASA's MESSENGER spacecraft was launched on a 7-year journey to Mercury, becoming the first probe to orbit the innermost planet. #MESSENGER #Mercury",
  "08-04": "On this day in 2007, the Phoenix Mars Lander was launched. It would later land in the Martian arctic to dig for water ice. #PhoenixLander #Mars",
  "08-05": "Happy birthday to Neil Armstrong (born 1930), the commander of Apollo 11 and the first person to walk on the Moon. A true legend. 🌕 #NeilArmstrong",
  "08-06": "In 2012, the Curiosity rover successfully landed on Mars using its audacious \"sky crane\" maneuver. A thrilling moment in planetary exploration! 🔴 #CuriosityRover #Mars",
  "08-07": "On this day in 1996, NASA announced the discovery of potential evidence of ancient, microscopic life in a Martian meteorite, ALH84001. #Mars #LifeOnMars",
  "08-08": "In 1978, the Pioneer Venus 2 mission was launched, which sent multiple probes into the atmosphere of Venus. #PioneerVenus",
  "08-09": "On this day in 1975, the European Space Agency (ESA) was officially established. #ESA",
  "08-10": "In 1990, the Magellan spacecraft entered orbit around Venus, using radar to map over 98% of the planet's cloud-obscured surface in stunning detail. #Magellan #Venus",
  "08-11": "On this day in 1877, astronomer Asaph Hall discovered Deimos, the smaller and more distant of Mars's two moons. #Deimos #Mars",
  "08-12": "The Perseid meteor shower, one of the best of the year, peaks tonight! Debris from Comet Swift-Tuttle will streak across the sky. 🌠 #Perseids #MeteorShower",
  "08-13": "Happy birthday to astronaut James \"Jim\" McDivitt (born 1929), commander of the Gemini 4 and Apollo 9 missions. #Astronaut",
  "08-14": "In 1984, the rings of Neptune were confirmed by astronomers André Brahic and William Hubbard. #Neptune #Rings",
  "08-15": "On this day in 1977, the Big Ear radio telescope at Ohio State University detected the \"Wow!\" signal, a strong, narrowband radio signal from space. A famous SETI candidate. 📡 #WowSignal #SETI",
  "08-16": "In 1963, the first photographs of the Earth from a geosynchronous satellite were transmitted by Syncom 2. #Syncom2 #Earth",
  "08-17": "On this day in 1877, just days after finding Deimos, Asaph Hall discovered Phobos, the larger moon of Mars. #Phobos #Mars",
  "08-18": "In 1976, the Soviet Luna 24 mission successfully returned a sample from the Moon's Mare Crisium. It was the last lunar sample return for nearly 45 years. #Luna24",
  "08-19": "Happy birthday to Gene Roddenberry (born 1921), the creator of Star Trek, whose vision of a hopeful future in space continues to inspire. 🖖 #StarTrek",
  "08-20": "On this day in 1975, NASA launched the Viking 1 mission to Mars, which consisted of both an orbiter and a lander. #Viking1 #Mars",
  "08-21": "In 2017, a spectacular total solar eclipse swept across the continental United States, captivating millions of observers. 🌘 #SolarEclipse #Eclipse2017",
  "08-22": "Happy birthday to astronaut Gus Grissom (born 1926), one of the original Mercury Seven astronauts and the first American to fly in space twice. #GusGrissom",
  "08-23": "On this day in 1966, the Lunar Orbiter 1 took the first-ever photograph of Earth from the vicinity of the Moon. 🌍 #Earthrise",
  "08-24": "In 2006, the International Astronomical Union (IAU) officially reclassified Pluto as a dwarf planet. A controversial but defining moment in astronomy. #Pluto",
  "08-25": "On this day in 1989, Voyager 2 made its closest approach to Neptune, giving humanity its first close-up look at the distant ice giant and its moon Triton. #Voyager2 #Neptune",
  "08-26": "Happy birthday to Benjamin P. Epps (born 1888), an early aviation pioneer whose work contributed to the future of flight. #Aviation",
  "08-27": "In 1962, the Mariner 2 spacecraft was launched to Venus. It would become the first spacecraft to successfully fly by another planet. #Mariner2",
  "08-28": "On this day in 1789, William Herschel discovered Enceladus, a moon of Saturn now known for its massive subsurface ocean and icy plumes. 🪐 #Enceladus",
  "08-29": "Happy birthday to astronaut and engineer C. Gordon Fullerton (born 1936), who piloted the third Space Shuttle mission and commanded the seventh. #SpaceShuttle",
  "08-30": "On this day in 1983, Guion Bluford became the first African American in space, launching aboard the Space Shuttle Challenger on mission STS-8. 🚀 #GuionBluford",
  "08-31": "In 1966, the first flight of the Hawker Siddeley Harrier took place. The V/STOL capabilities of aircraft like the Harrier influenced future aerospace design. #Aviation",
  "09-01": "On this day in 1979, the Pioneer 11 spacecraft became the first human-made object to fly by Saturn, passing just 21,000 km from its cloud tops. 🪐 #Pioneer11 #Saturn",
  "09-02": "Happy birthday to astronaut Frank Drake (born 1930), a pioneer in the search for extraterrestrial intelligence (SETI) and creator of the Drake Equation. #SETI",
  "09-03": "In 1976, the Viking 2 lander successfully touched down on Mars in the Utopia Planitia, beginning its 3.5-year mission to study the Martian surface. 🔴 #Viking2 #Mars",
  "09-04": "On this day in 1993, the Hubble Space Telescope photographed the globular cluster M15. #Hubble #Astrophotography",
  "09-05": "In 1977, NASA launched the Voyager 1 space probe on its \"Grand Tour\" of the outer planets. It is now the most distant human-made object in space. 🚀 #Voyager1",
  "09-06": "Happy birthday to John Dalton (born 1766), the English chemist whose atomic theory revolutionized our understanding of matter. #ScienceHistory",
  "09-07": "On this day in 1995, the Galileo spacecraft's atmospheric probe was released on its course to plunge into Jupiter's dense atmosphere. #Galileo #Jupiter",
  "09-08": "In 1966, the television series Star Trek premiered. Its hopeful vision of humanity's future in space continues to inspire scientists and explorers. 🖖 #StarTrek",
  "09-09": "On this day in 1975, the Viking 2 spacecraft was launched, following its twin, Viking 1, on a mission to orbit and land on Mars. #Viking2",
  "09-10": "In 2008, the Large Hadron Collider (LHC) at CERN was powered on for the first time, beginning its journey to unlock the secrets of particle physics. #LHC #CERN",
  "09-11": "On this day in 1997, the Mars Global Surveyor spacecraft successfully entered orbit around Mars, beginning a 9-year mission to map the planet. #MarsGlobalSurveyor",
  "09-12": "In 1992, Mae Jemison launched aboard the Space Shuttle Endeavour, becoming the first African American woman in space. On this day in 1959, the Soviet Luna 2 launched to the Moon. #MaeJemison #Luna2",
  "09-13": "On this day in 1959, Luna 2 became the first human-made object to impact another celestial body when it crashed onto the surface of the Moon. 🌕 #Luna2",
  "09-14": "In 1968, the Soviet Zond 5 mission was launched. It carried the first living beings (turtles, insects, and plants) to circle the Moon and return safely to Earth. 🐢 #Zond5",
  "09-15": "On this day in 2017, the Cassini spacecraft ended its 13-year mission at Saturn by plunging into the planet's atmosphere, returning data until the very end. A true grand finale. #Cassini",
  "09-16": "In 1987, the Montreal Protocol was signed, an international treaty designed to protect the ozone layer. Satellites play a key role in monitoring its health. 🌍 #OzoneLayer",
  "09-17": "On this day in 1789, William Herschel discovered Mimas, a moon of Saturn known for its massive Herschel Crater, which gives it a resemblance to the Death Star. #Mimas #Saturn",
  "09-18": "In 1977, the Voyager 1 spacecraft took the first-ever photograph showing the Earth and Moon together in a single frame, a beautiful portrait from 7.25 million miles away. #Voyager1",
  "09-19": "Happy birthday to astronaut Sunita Williams (born 1965), a veteran of two long-duration stays on the International Space Station. 👩‍🚀 #Astronaut",
  "09-20": "On this day in 1970, the Soviet Luna 16 probe returned to Earth, successfully delivering the first lunar soil sample collected entirely by a robotic spacecraft. #Luna16",
  "09-21": "In 2003, the Galileo spacecraft concluded its 14-year mission by plunging into Jupiter's atmosphere, a planned event to prevent any potential contamination of its icy moons. #Galileo",
  "09-22": "Today is the September Equinox! Day and night are of nearly equal length as the Sun shines directly on the equator, marking the start of autumn in the Northern Hemisphere. 🍂 #Equinox",
  "09-23": "On this day in 1846, the planet Neptune was discovered by Johann Galle, using calculations from Urbain Le Verrier that predicted its location. A triumph of celestial mechanics. #Neptune",
  "09-24": "In 1999, the Mars Climate Orbiter was lost upon arrival at Mars due to a metric-to-imperial unit conversion error, a costly but valuable lesson in engineering. #NASA",
  "09-25": "Happy birthday to Ole Rømer (born 1644), the Danish astronomer who made the first quantitative measurements of the speed of light. #Physics",
  "09-26": "Today in 1905, Albert Einstein published his paper on the special theory of relativity, which introduced the famous equation E=mc². #Einstein #Relativity",
  "09-27": "In 2007, NASA's Dawn spacecraft was launched on a unique mission to orbit two different bodies in the main asteroid belt: Vesta and Ceres. #DawnMission",
  "09-28": "On this day in 2008, SpaceX successfully launched the Falcon 1, becoming the first privately developed liquid-fueled rocket to reach orbit. A pivotal moment for the company. 🚀 #SpaceX",
  "09-29": "In 1977, the Soviet Union launched the Salyut 6 space station, the first to feature two docking ports, allowing for crew handovers and cargo resupply. #Salyut6",
  "09-30": "On this day in 2016, the European Space Agency's Rosetta mission ended with a controlled impact onto the surface of Comet 67P, the comet it had studied for over two years. ☄️ #Rosetta",
  "10-01": "On this day in 1958, NASA was officially created and began operations, succeeding the National Advisory Committee for Aeronautics (NACA). Happy birthday, NASA! 🎂 #NASA",
  "10-02": "Happy birthday to astronaut and commander of Apollo 12, Charles \"Pete\" Conrad (born 1930), the third person to walk on the Moon. #Apollo12",
  "10-03": "In 1942, a German V-2 rocket became the first human-made object to reach space, crossing the Kármán line at an altitude of 100 km. #V2Rocket #SpaceHistory",
  "10-04": "On this day in 1957, the Soviet Union launched Sputnik 1, the world's first artificial satellite. The event kicked off the Space Race and the start of World Space Week. 🛰️ #Sputnik #WorldSpaceWeek",
  "10-05": "Happy birthday to Robert H. Goddard (born 1882), the father of modern rocketry, whose work was fundamental to the space age. 🚀 #RobertGoddard",
  "10-06": "In 1995, astronomers Michel Mayor and Didier Queloz announced the discovery of 51 Pegasi b, the first exoplanet found orbiting a Sun-like star. A Nobel Prize-winning discovery. #Exoplanet",
  "10-07": "On this day in 1959, the Soviet Luna 3 probe took the first-ever photographs of the far side of the Moon, revealing it to be rugged and cratered. 🌕 #Luna3",
  "10-08": "In 2007, Peggy Whitson launched on Soyuz TMA-11, becoming the first female commander of the International Space Station. #ISS #WomenInSTEM",
  "10-09": "In 1604, a supernova now known as Kepler's Supernova was first observed in the constellation Ophiuchus. It remains the most recent supernova in our galaxy to have been observed by the naked eye. ✨ #Supernova",
  "10-10": "On this day in 1967, the Outer Space Treaty, the foundational legal framework for international space law, entered into force. #SpaceLaw",
  "10-11": "In 1968, Apollo 7 launched, becoming the first crewed flight of the Apollo spacecraft. The 11-day mission tested the command and service module in Earth orbit. #Apollo7",
  "10-12": "On this day in 1964, the Soviet Union launched Voskhod 1, the first spaceflight to carry more than one person, with a three-cosmonaut crew. #Voskhod1",
  "10-13": "Today in 2021, actor William Shatner, Captain Kirk of Star Trek, flew to space aboard a Blue Origin New Shepard rocket, becoming the oldest person to do so. 🚀 #WilliamShatner",
  "10-14": "On this day in 1947, Chuck Yeager became the first person to officially break the sound barrier, piloting the Bell X-1 rocket plane. #SoundBarrier #Aviation",
  "10-15": "In 1997, the Cassini-Huygens spacecraft was launched on its 7-year journey to Saturn, one of the most ambitious planetary missions ever undertaken. #Cassini #Saturn",
  "10-16": "Happy birthday to astronaut and engineer Mae C. Jemison, the first African American woman in space. 🎂 #MaeJemison",
  "10-17": "On this day in 2017, the LIGO and Virgo observatories detected gravitational waves from a pair of colliding neutron stars, an event that was also seen by conventional telescopes, heralding a new era of astronomy. #LIGO #GravitationalWaves",
  "10-18": "In 2019, astronauts Christina Koch and Jessica Meir conducted the first all-female spacewalk outside the International Space Station. A historic milestone. 👩‍🚀 #Spacewalk",
  "10-19": "Happy birthday to Subrahmanyan Chandrasekhar (born 1910), the astrophysicist who calculated the maximum mass of a white dwarf star—the Chandrasekhar limit. #Astrophysics",
  "10-20": "On this day in 2016, the ExoMars Trace Gas Orbiter successfully entered orbit around Mars to study trace gases in its atmosphere. #ExoMars #Mars",
  "10-21": "The Orionid meteor shower, debris from Comet 1P/Halley, peaks tonight! Look for fast-moving meteors streaking across the sky. 🌠 #Orionids",
  "10-22": "In 1966, the Soviet Luna 12 probe was launched, successfully entering lunar orbit to map the Moon's surface. #Luna12",
  "10-23": "Happy birthday to astronomer and planetary scientist Carolyn Porco (born 1953), the leader of the imaging science team for the Cassini mission at Saturn. #WomenInSTEM",
  "10-24": "On this day in 1998, the Deep Space 1 spacecraft was launched, successfully testing 12 advanced, high-risk technologies, including an ion engine. #DeepSpace1",
  "10-25": "In 1671, astronomer Giovanni Cassini discovered Iapetus, a two-toned moon of Saturn with a mysterious equatorial ridge. #Iapetus #Saturn",
  "10-26": "Today in 2006, the STEREO (Solar Terrestrial Relations Observatory) mission was launched, with two nearly identical spacecraft providing the first-ever 3D views of the Sun. ☀️ #STEREO #Sun",
  "10-27": "Happy birthday to astronaut and naval aviator Michael J. Smith (born 1945), who served as the pilot of the Space Shuttle Challenger's final mission, STS-51-L. #Astronaut",
  "10-28": "On this day in 1961, the first Saturn I rocket was launched on a successful suborbital test flight, a key step on the path to the Moon. 🚀 #SaturnI #NASA",
  "10-29": "In 1991, the Galileo spacecraft performed the first-ever close flyby of an asteroid, 951 Gaspra. #Galileo #Asteroid",
  "10-30": "On this day in 1985, the Space Shuttle Challenger launched on mission STS-61-A, carrying the German Spacelab D-1 and a record crew of eight astronauts. #SpaceShuttle",
  "10-31": "In 2000, the Expedition 1 crew launched aboard a Soyuz rocket, becoming the first long-duration crew to live on the International Space Station. Happy Halloween! 🎃 #ISS",
  "11-01": "In 1963, the Arecibo Observatory in Puerto Rico was officially dedicated. For decades, its massive 305-meter dish was the largest single-aperture radio telescope in the world. 📡 #Arecibo",
  "11-02": "On this day in 2000, the Expedition 1 crew docked with the International Space Station, beginning an era of continuous human presence in space that continues to this day. #ISS",
  "11-03": "In 1957, the Soviet Union launched Sputnik 2, carrying the dog Laika, the first animal to orbit the Earth. #Sputnik2 #Laika",
  "11-04": "Happy birthday to Charles K. Kao (born 1933), the Nobel Prize-winning physicist whose work on fiber optics revolutionized global communications. #FiberOptics",
  "11-05": "On this day in 1964, NASA launched Mariner 3 on a flyby mission to Mars. The mission failed when its payload shroud did not jettison. #Mariner3 #Mars",
  "11-06": "In 1572, a supernova now known as Tycho's Supernova was first observed in the constellation Cassiopeia. It was visible in daylight for over two weeks. ✨ #Supernova #Tycho",
  "11-07": "On this day in 1996, NASA launched the Mars Global Surveyor, a trailblazing mission that mapped the Red Planet in unprecedented detail. #MarsGlobalSurveyor",
  "11-08": "Happy birthday to Edmond Halley (born 1656), the English astronomer who calculated the orbit of the comet that now bears his name. ☄️ #EdmondHalley",
  "11-09": "Happy birthday to Carl Sagan (born 1934), the brilliant astronomer and science communicator whose work inspired millions to look up at the cosmos. 🌌 #CarlSagan",
  "11-10": "On this day in 1970, the Soviet Union launched Luna 17, which successfully deployed Lunokhod 1, the first robotic rover to explore another world. #Lunokhod1 #Moon",
  "11-11": "In 1966, NASA launched Gemini 12, the final mission of the Gemini program, carrying astronauts Jim Lovell and Buzz Aldrin. Aldrin's successful spacewalks paved the way for Apollo. #Gemini12",
  "11-12": "On this day in 2014, the European Space Agency's Philae lander successfully touched down on Comet 67P/Churyumov–Gerasimenko. A historic first! #Philae #Comet",
  "11-13": "In 1971, Mariner 9 became the first spacecraft to orbit another planet, arriving at Mars and waiting out a global dust storm before sending back incredible images. 🔴 #Mariner9",
  "11-14": "On this day in 1969, Apollo 12 launched on the second mission to land humans on the Moon, performing a pinpoint landing next to the Surveyor 3 probe. 🚀 #Apollo12",
  "11-15": "In 1988, the Soviet Union conducted the first and only orbital flight of its Buran space shuttle, an uncrewed test mission. #Buran #SpaceShuttle",
  "11-16": "On this day in 1974, the Arecibo Message, a coded message to potential extraterrestrials, was broadcast from the Arecibo radio telescope toward the M13 star cluster. #AreciboMessage #SETI",
  "11-17": "The Leonid meteor shower, famous for its spectacular storms, peaks tonight! Look for fast-moving meteors associated with Comet Tempel-Tuttle. 🌠 #Leonids",
  "11-18": "In 1989, NASA's Cosmic Background Explorer (COBE) satellite was launched to measure the faint glow of the Big Bang, providing crucial evidence for the theory. #COBE",
  "11-19": "On this day in 1969, Apollo 12 astronauts Pete Conrad and Alan Bean landed on the Moon's Ocean of Storms. #Apollo12 #MoonLanding",
  "11-20": "In 1998, Russia launched the Zarya module, the first component of the International Space Station, from Baikonur Cosmodrome. 🛰️ #ISS",
  "11-21": "Today in 2015, a Blue Origin New Shepard rocket became the first to fly to space and return for a powered, vertical landing, a key step in rocket reusability. #BlueOrigin",
  "11-22": "Happy birthday to Guion Bluford (born 1942), the first African American to travel to space, flying on four Space Shuttle missions. 🧑‍🚀 #GuionBluford",
  "11-23": "Today in 1977, the Meteosat 1 satellite was launched, the first of a long and successful series of European weather satellites. 🌍 #Meteosat",
  "11-24": "On this day in 1969, the Apollo 12 crew successfully splashed down in the Pacific Ocean, concluding the second human mission to the Moon. #Apollo12",
  "11-25": "In 1915, Albert Einstein first presented his field equations of general relativity, fundamentally changing our understanding of gravity, space, and time. #Einstein",
  "11-26": "On this day in 2011, the Mars Science Laboratory mission was launched, carrying the Curiosity rover to explore Gale Crater on Mars. #CuriosityRover #Mars",
  "11-27": "In 1971, the Soviet Mars 2 probe reached Mars. Its lander malfunctioned and crashed, but it became the first human-made object to impact the Martian surface. #Mars2",
  "11-28": "On this day in 1964, NASA launched the Mariner 4 spacecraft on the first successful flyby mission to Mars. #Mariner4 #Mars",
  "11-29": "In 1961, the Mercury-Atlas 5 mission launched, carrying the chimpanzee Enos on a two-orbit flight, a final test before the first crewed U.S. orbital mission. 🐒 #ProjectMercury",
  "11-30": "On this day in 1954, a meteorite crashed through the roof of a house in Sylacauga, Alabama, striking Ann Hodges in the only confirmed case of a person being hit by a meteorite. ☄️ #Meteorite",
  "12-01": "On this day in 2020, the iconic Arecibo radio telescope's instrument platform tragically collapsed, ending 57 years of astronomical discoveries. #Arecibo",
  "12-02": "In 1995, the Solar and Heliospheric Observatory (SOHO), a joint NASA/ESA mission, was launched to study the Sun from its core to its outer corona. ☀️ #SOHO #Sun",
  "12-03": "On this day in 1973, Pioneer 10 performed the first-ever flyby of Jupiter, capturing the first close-up images of the giant planet. #Pioneer10 #Jupiter",
  "12-04": "In 1998, the Space Shuttle Endeavour launched on mission STS-88, carrying Unity, the first American-built module for the International Space Station. #ISS",
  "12-05": "Happy birthday to Werner Heisenberg (born 1901), the Nobel Prize-winning physicist and a key pioneer of quantum mechanics. #Physics",
  "12-06": "On this day in 1957, the United States' first attempt to launch a satellite, Vanguard TV3, failed spectacularly on the launchpad just seconds after liftoff. #Vanguard #SpaceRace",
  "12-07": "In 1972, Apollo 17 launched on the final mission of the Apollo program. It was the only night launch of a Saturn V and carried the only geologist to walk on the Moon. 🚀 #Apollo17",
  "12-08": "On this day in 2010, SpaceX's Dragon C1 became the first privately built and operated spacecraft to be successfully launched into orbit and recovered. #SpaceX #Dragon",
  "12-09": "In 1978, the Pioneer Venus 2 mission's probes entered the atmosphere of Venus, returning data on its composition and structure. #PioneerVenus",
  "12-10": "Happy birthday to Ada Lovelace (born 1815), the mathematician and writer often regarded as the first computer programmer. Her work is foundational to the software that runs space missions. 💻 #WomenInSTEM",
  "12-11": "On this day in 1972, Apollo 17 astronauts Gene Cernan and Harrison Schmitt landed in the Taurus-Littrow valley, beginning the final human exploration of the Moon. 🌕 #Apollo17",
  "12-12": "In 1961, OSCAR 1, the first satellite built by amateur radio enthusiasts, was launched. It was the world's first non-governmental satellite. #HamRadio #OSCAR1",
  "12-13": "The Geminid meteor shower, one of the most spectacular of the year, peaks tonight! The meteors are debris from the asteroid 3200 Phaethon. 🌠 #Geminids",
  "12-14": "On this day in 1962, the Mariner 2 spacecraft flew by Venus, becoming the first successful planetary encounter. On this day in 1972, Gene Cernan became the last person to walk on the Moon. #Mariner2 #Apollo17",
  "12-15": "In 1970, the Soviet Venera 7 probe became the first spacecraft to successfully soft-land on another planet (Venus) and transmit data from the surface. #Venera7",
  "12-16": "Happy birthday to Arthur C. Clarke (born 1917), the visionary science fiction author and futurist who first proposed the concept of geostationary communications satellites. 📚 #ArthurCClarke",
  "12-17": "On this day in 1903, Orville and Wilbur Wright made the first successful powered, sustained flight at Kitty Hawk, North Carolina. The age of aviation began. ✈️ #WrightBrothers",
  "12-18": "In 1958, the United States launched Project SCORE, the world's first communications satellite, which broadcast a Christmas message from President Eisenhower. 🛰️ #ProjectSCORE",
  "12-19": "On this day in 1972, the crew of Apollo 17 splashed down safely in the Pacific Ocean, concluding the final mission of the Apollo lunar program. #Apollo17",
  "12-20": "In 2019, the United States Space Force was founded as a new branch of the Armed Forces. #SpaceForce",
  "12-21": "On this day in 1968, Apollo 8 launched, becoming the first crewed mission to leave Earth orbit, travel to the Moon, and orbit it. Today is also the Winter Solstice! ❄️ #Apollo8 #Solstice",
  "12-22": "In 2015, SpaceX achieved a major milestone by successfully landing a Falcon 9 first-stage booster for the first time after an orbital launch. 🚀 #SpaceX",
  "12-23": "On this day in 1672, astronomer Giovanni Cassini discovered Rhea, the second-largest moon of Saturn. #Rhea #Saturn",
  "12-24": "In 1968, the crew of Apollo 8 entered orbit around the Moon and delivered their famous Christmas Eve broadcast, reading from the Book of Genesis and showing humanity the first live images of an Earthrise. 🌍 #Apollo8",
  "12-25": "On this day in 2021, the James Webb Space Telescope was launched! On this day in 2004, the Huygens probe separated from Cassini to begin its journey to Titan. Happy birthday to Isaac Newton (born 1642)! 🎄 #JWST #Newton",
  "12-26": "In 1974, the Soviet Salyut 4 space station was launched. It would host two crews for a total of 93 days. #Salyut4",
  "12-27": "Happy birthday to Johannes Kepler (born 1571), the German astronomer who discovered the laws of planetary motion. #Kepler",
  "12-28": "On this day in 1924, Edwin Hubble announced his discovery that the Andromeda \"nebula\" was in fact another galaxy, fundamentally expanding our concept of the universe. 🌌 #Hubble",
  "12-29": "In 1997, the Galileo spacecraft made its second close flyby of Jupiter's moon Europa, strengthening evidence for a subsurface ocean. #Galileo #Europa",
  "12-30": "Happy birthday to Edwin Hubble (born 1889), the American astronomer whose observations proved that the universe is expanding. 🔭 #EdwinHubble",
  "12-31": "In 1600, the British East India Company was chartered, a venture that spurred advancements in navigation and astronomy. A good day to reflect on the past year in space and look forward to the next! 🎉 #NewYearsEve"
}
